# Actividad - Trabajando con DataFrames de Pandas.
## Criterios de evaluación.

* Se deben utilizar nombres de variables descriptivos y claros (Utilizar la nomeclatura correspondiente para los nombres de variables).
* Comentarios claros y concisos que expliquen el propósito de cada sección del código.
* Utilizar mensajes de commit **descriptivos**. (Puedes utilizar la extension CONVENTIONAL COMMIT de VS-CODE). 
* Entrega en tiempo y forma.
* Todo el código desarrollado debe ser subido a un repositorio en GitHub (el nombre del repositorio de seguir la siguiente estructura: pandas_df_tlp3_nombre_apellido).
* Para resolver las actividades se debe insertar casillas de codigo entre cada actividad del cuaderno de Jupyter
* Deben trabajar con el datasets adjunto a la actividad

### ¡Importante!
**El incumplimiento de los criterios de evaluación restará puntos en la nota final del práctico!**

In [9]:
import pandas as pd
import sqlite3

#Aqui agrega la conexión a la base de datos
connexion=sqlite3.connect("Salaries.sqlite") 
#Crea el dataframe con los datos del datasets
df=pd.read_sql_query("SELECT * FROM Salaries", connexion)
df
#Cierra la conexión a la base de datos
connexion.close()

In [10]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

1. **Top 10 empleados con mayor salario total (incluyendo beneficios)**
Extrae e imprime un top 10 de expleados con mayor salario incluyendo los beneficios

In [11]:
#todo
top_10=df[["EmployeeName", "TotalPayBenefits"]].sort_values("TotalPayBenefits", ascending=False).head(10)

print("Los 10 empleados con mayor salario son:")

top_10

Los 10 empleados con mayor salario son:

                EmployeeName  TotalPayBenefits
0             NATHANIEL FORD         567595.43
1               GARY JIMENEZ         538909.28
110531           David Shinn         510732.68
110532            Amy P Hart         479652.21
110533  William J Coaker Jr.         436224.36
72925         Gregory P Suhr         425815.28
72926   Joanne M Hayes-White         422353.40
110534        Gregory P Suhr         418019.22
110535  Joanne M Hayes-White         417435.10
110536       Ellen G Moffatt         415767.94

2. **Filtrar empleados con más de 50,000 en horas extra, la columna a tratar es: (OvertimePay)**

In [12]:
df=df[["EmployeeName", "OvertimePay"]]
df["OvertimePay"]=pd.to_numeric(df["OvertimePay"], errors="coerce")
df

             EmployeeName  OvertimePay
0          NATHANIEL FORD         0.00
1            GARY JIMENEZ    245131.88
2          ALBERT PARDINI    106088.18
3       CHRISTOPHER CHONG     56120.71
4         PATRICK GARDNER      9737.00
...                   ...          ...
148649      Roy I Tillery         0.00
148650       Not provided          NaN
148651       Not provided          NaN
148652       Not provided          NaN
148653          Joe Lopez         0.00

[148654 rows x 2 columns]

In [13]:
#todo
df=df[["EmployeeName", "OvertimePay"]]
mayores_horas=df[df["OvertimePay"]>50000]
print("Los empleados con más de 50,000 de horas extras son:")
mayores_horas.head(10)

Los empleados con más de 50,000 de horas extras son:

         EmployeeName  OvertimePay
1        GARY JIMENEZ    245131.88
2      ALBERT PARDINI    106088.18
3   CHRISTOPHER CHONG     56120.71
6           ALSON LEE     89062.90
8      MICHAEL MORRIS     86362.68
10      ARTHUR KENNEY     71344.88
11   PATRICIA JACKSON     87082.62
14     DAVID FRANKLIN     74050.30
15    RICHARD CORRIEA     73478.20
17     SEBASTIAN WONG    119397.26

3. **Contar cuántos empleados únicos hay por año**

In [15]:
#todo
años=df["Year"]
años.head(10)
# cantidad_empleados_anio = df.groupby('Year')['EmployeeName'].nunique() ##la columna Year siguen sin reconocer
# cantidad_empleados_anio

KeyError: 'Year'

4. **Ver cuántos cargos únicos (JobTitle) existen y los 5 más comunes**

In [ ]:
#todo
cargos_unicos = df['JobTitle'].value_counts().nunique()
print("El número de cargos únicos es:")
cargos_unicos

El número de cargos únicos es:

294

In [ ]:
top_5=df["JobTitle"].value_counts().sort_values( ascending=False).head(5)
print("Los 5 cargos con más empleados son:")

top_5

Los 5 cargos con más empleados son:

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

5. **Mostrar el salario total (TotalPay) promedio por año**

In [ ]:
#todo
salario_total=df.groupby("Year")["TotalPayBenefits"].mean()
print("El salario promedio por año es:")
salario_total

El salario promedio por año es:

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100261.438668
Name: TotalPayBenefits, dtype: float64

6. **Exporta todos los datos a un CSV y muestra los ultimos 10 valores**

In [ ]:
#todo
df.to_csv("Salaries_con_cambios.csv", index=False)